src/DataProcessors/БлокировкаСоединенийСИнформационнойБазой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>БлокировкаСоединенийСИнформационнойБазой</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстановитьБлокировкуСоединений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/БлокировкаСоединенийСИнформационнойБазой/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура устанавливает блокировку соединений с ИБ,
// в соответствиями со значениями реквизитов объекта.
// При установке блокировки в информационной базе включается
// механизм завершения работы пользователей (включая пользователя,
// инициировавшего блокировку).
//
Процедура УстановитьБлокировку() Экспорт	
    # Если Клиент Тогда             
        Если УстановитьБлокировкуСоединений Тогда
            // поскольку блокировка еще не установлена, то при входе в систему
            // для данного пользователя был подключен обработчик ожидания завершения работы.
            // Отключаем его. Так как для этого пользователя подключается специализированный обработчки ожидани
            // "ЗавершитьРаботуПользователей", который ориентирован на то, что данный пользователь
            // должен быть отключен последним.        
            
            ОтключитьОбработчикОжидания("КонтрольРежимаЗавершенияРаботыПользователей");
            ПодключитьОбработчикОжидания("ЗавершитьРаботуПользователей", 60);	
        КонецЕсли;
    # КонецЕсли 

    
	// параметры блокировки
	Блокировка = Новый БлокировкаУстановкиСоединений;
	
	Блокировка.Начало 			= НачалоБлокировки;
	Блокировка.Конец  			= ОкончаниеБлокировки;
	Блокировка.Сообщение 		= Сообщение;
	Блокировка.Установлена 		= УстановитьБлокировкуСоединений;
	Блокировка.КодРазрешения 	= КодРазрешения;	
	
	// установка блокировки соединений
	УстановитьБлокировкуУстановкиСоединений(Блокировка)
КонецПроцедуры // УстановитьБлокировку()
